// JS. Додаткові ДЗ по масивах та циклах
// #WpkK0ZH1
//
// –створити масив з:
//
//     – з 5 числових значень
// let arrN = [5, 54, 78, 84, 214]
// //
// // – з 5 стічкових значень
// let arrS = ['Okten', 'school', 'Maietskyi', 'Java Script', 'Full stack']
// //
// // – з 5 значень стрічкового, числового та булевого типу
// let arrM = ['Maietskyi', 108, true, 'Okten', 266, false, 'JavaScript']
// //
// // – та вивести його в консоль
// console.log(arrN, arrS, arrM)
//
// #4aDbSgh
//
// — Створити пустий масив. Наповнити його будь-якими значеннями, звертаючись до конкретного індексу. Вивести в консоль
//
// let arr = []
// arr[0] = 1;
// arr[2] = 3;
// arr[4] = 5;
// arr[3] = 4;
// arr[1] = 2;
// console.log(arr)
//
// #qLQLJSeN7i
//
// – є масив [2,17,13,6,22,31,45,66,100,-18] :
let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
//
// 1. перебрати його циклом while
// let i = 0;
// while (i < arr.length) {
//     console.log(arr[i]);
//     i++
// }
//
//     2. перебрати його циклом for
// for (let i = 0; i < arr.length; i++){
//     console.log(arr[i]);
// }
//
// for (let i of arr) {
//     console.log(i);
// }
//
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = 0;
// // debugger
// while (i < arr.length) {
//     if (arr[i] % 2 !== 0) {
//         console.log(arr[i])
//     }
//     i++
// }
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 !== 0) {
//         console.log(arr[i]);
//     }
// }
//
// for (let i of arr) {
//     if (i % 2 !== 0) {
//         console.log(i);
//     }
// }
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let i = 0;
// while (i < arr.length) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
//     i++
// }
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) console.log(arr[i]);
// }
//
// 7. замінити кожне число, кратне 3, на слово “okten”
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'Okten'
//     }
// }
// console.log(arr)
//
// let i = 0;
// while (i < arr.length) {
//     if (arr[i] % 3 === 0) arr[i] = 'Okten'
//     i++
// }
// console.log(arr)
//
// 8. вивести масив у зворотньому порядку.
// for (let i= arr.length; i > 0; i--) {
//     console.log(arr[i]);
// }
//
// let i = arr.length;
// while (i > 0) {
//     console.log(arr[i])
//     i--
// }
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)
//
// 1. перебрати його циклом while
// let i = arr.length;
// while (i > 0) {
//     console.log(arr[i]);
//     i--
// }
//
//     2. перебрати його циклом for
// for (let i = arr.length; i > 0; i--){
//     console.log(arr[i]);
// }
//
// for (let i of arr) {
//     console.log(i);
// }
//
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let i = arr.length;
// // debugger
// while (i > 0) {
//     if (arr[i] % 2 !== 0) {
//         console.log(arr[i])
//     }
//     i--
// }
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for (let i = arr.length; i > 0; i--) {
//     if (arr[i] % 2 !== 0) {
//         console.log(arr[i]);
//     }
// }
//
// for (let i of arr) {
//     if (i % 2 !== 0) {
//         console.log(i);
//     }
// }
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let i = arr.length;
// debugger
// while (i > 0) {
//     if (arr[i] % 2 === 0) {
//         console.log(arr[i]);
//     }
//     i--
// }
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for (let i = arr.length; i > 0; i--) {
//     if (arr[i] % 2 === 0) console.log(arr[i]);
// }
//
// 7. замінити кожне число, кратне 3, на слово “okten”
// for (let i = arr.length-1; i > 0; i--) {
//     if (arr[i] % 3 === 0) {
//         arr[i] = 'Okten'
//     }
//     console.log(arr[i])
// }
// console.log(arr)
// //
// let i = arr.length - 1;
// while (i > 0) {
//     if (arr[i] % 3 === 0) arr[i] = 'Okten'
//     console.log(arr[i])
//     i--
// }
//
// #yHAwJOyiC
//
// – Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
//
//     #GamKju89ob
//
// – Створити масив з 10 строкових елементів. Вивести в консоль всі його елементи в циклі.
//
//     #Bm76xmg
//
// – Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
//
//     #u3vmD0YJXh
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
//
// #9stMq2ou
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
//
// #mK4pmM4
//
// – Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
//
//
// #0pm3EyTKy9
//
// – Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
//
//     #mDMWMW5a
//
// – Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//
// #4sXhaa5YMM
//
// – Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
//
// #s24slNyz7
//
// – Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
//
// #zananT5FR1
//
// – Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
//
// #Tfrwls7FM
//
// – Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
//
//
// #reLkOkTB29Q
//
// створити масив книжок (назва, кількість сторінок, автори , жанри).
//
// – знайти найбільшу книжку.
//
// – знайти книжку/ки з найбільшою кількістю жанрів
//
// – знайти книжку/ки з найдовшою назвою
//
// – знайти книжку/ки, які писали 2 автори
//
// – знайти книжку/ки, які писав 1 автор
//
//
//
// 1. Створити пустий масив та :
//
//     a. заповнити його 50 парними числами за допомоги циклу.
//
//     b. заповнити його 50 непарними числами за допомоги циклу.
//
//     c. Заповнити масив 20-ма рандомними числами. (Google: Generate random number JS)
//
// d. Заповнити масив 20-ма рандомними числами в діапазоні від 8 до 732 (Google: Generate random number JS)
//
// 2. Вивести за допомогою console.log кожен третій елемент
//
// 3. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним.
//
// 4. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним, та записати їх в новий масив
//
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
//
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
//
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//
// 8. Створити масив з будь-якими значеннями (стрінги, числа, і тд…). пройтись по ньому, і, якщо елемент є числом, додати його в інший масив.
//
//
//
//
//
//
//
// – Дано 2 масиви з рівною кількістю об’єктів.
//
//     Масиви:
//
// let usersWithId = [
//
//     {id: 1, name: ‘vasya’, age: 31, status: false},
//
// {id: 2, name: ‘petya’, age: 30, status: true},
//
// {id: 3, name: ‘kolya’, age: 29, status: true},
//
// {id: 4, name: ‘olya’, age: 28, status: false}
//
// ];
//
//
//
// let citiesWithId = [
//
//     {user_id: 3, country: ‘USA’, city: ‘Portland’},
//
// {user_id: 1, country: ‘Ukraine’, city: ‘Ternopil’},
//
// {user_id: 2, country: ‘Poland’, city: ‘Krakow’},
//
// {user_id: 4, country: ‘USA’, city: ‘Miami’}
//
// ];
//
//
//
// З’єднати в один об’єкт користувача та місто з відповідними “id” та “user_id” .
//
// Записати цей об’єкт в новий масив
//
// Example:
//
//     let usersWithCities = [
//
//         {
//
//             id: 1, // <===
//
//             name: ‘vasya’,
//
// age: 31,
//
//     status: false,
//
//     address: {
//
//     user_id: 1, // <===
//
//         country: ‘Ukraine’,
//
//     city: ‘Ternopil’
//
// }
//
// },
//
// // TO BE CONTINUED …..
//
// ]
//
//
//
//
//
//
//
//
//
// – Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
//
//
//
// – Взяти масив з 10 чисел або створити його. Створити 2-й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
//
//
//
// – Дано масив: [ ‘a’, ‘b’, ‘c’] . За допомогою циклу for зібрати всі букви в слово.
//
// – Дано масив: [ ‘a’, ‘b’, ‘c’] . За допомогою циклу while зібрати всі букви в слово.
//
// – Дано масив: [ ‘a’, ‘b’, ‘c’] . За допомогою циклу for of зібрати всі букви в слово.